<?php

return [
    'title' => "تنصيب موقع النقي",
    'welcome' => "مرحبا بك في صفحة التنصيب",
    'start' => "بدأ التنصيب",

    'licence' => [
        'title' => 'مفتاح الترخيص',
        'next' => 'تأكيد الترخيص',

        'form' => [
            'label' => 'مفتاح الترخيص'
        ]
    ],

    'permissions' => [
        'title' => "تراخيص المجلدات",
        'next' => 'الخطوة التالية',
        'error' => "المرجو إصلاح الأخطاء قبل الخطوة التالية"
    ],

    'requirements' => [
        'title' => "المتطلبات",
        'next' => 'الخطوة التالية',
        'error' => "المرجو إصلاح الأخطاء قبل الخطوة التالية"
    ],

    'environment' => [
        'title' => "ملف .env",
        'next' => 'الخطوة التالية',
        'save' => 'حفظ'
    ],

    'database' => [
        'title' => "قاعدة البيانات",
        'next' => 'الخطوة التالية',
    ],

    'admin' => [
        'title' => "إضافة مشرف للموقع",
        'next' => 'الخطوة التالية',
        'save' => 'تأكيد',

        'form' => [
            'name' => "الإسم الكامل",
            "email" => "البريد الالكتروني",
            "password" => "كلمة السر",
        ]
    ],

    'final' => [
        'title' => "تم تنصيب الموقع",
        'desc' => "تم تنصيب الموقع بنجاح",
        'home_page' => "الصفحة الرئيسية"
    ],

    'errors' => [
        'licence_missing' => "المرجو تفعيل السكريبت قبل أي خطوة أخرى",
        'permissions' => "المرجو التحقق من تراخيص المجلدات قبل أي خطوة أخرى",
        'requirements' => 'المرجو التحقق من المتطلبات قبل أي خطوة أخرى',
        'database' => 'المرجو التحقق من معلومات الاتصال بقاعدة البيانات'
    ]
];
